import s from './HistoryItem.module.scss';
import FileAddedInfo
  from "@/components/RequestDetailsPage/request-components/RequestHistory/HistoryItem/types-infos/FileAddedInfo.jsx";
import FileRemovedInfo
  from "@/components/RequestDetailsPage/request-components/RequestHistory/HistoryItem/types-infos/FileRemovedInfo.jsx";
import TagsInfo
  from "@/components/RequestDetailsPage/request-components/RequestHistory/HistoryItem/types-infos/TagsInfo.jsx";
import TitleInfo
  from "@/components/RequestDetailsPage/request-components/RequestHistory/HistoryItem/types-infos/TitleInfo.jsx";
import {useMediaQuery} from "react-responsive";
import {formatDatShortMonth, getDateLabel} from "@/utils/oneRequest.js";

const HistoryItem = ({event, isLast}) => {

  const isDesktop = useMediaQuery({minWidth: 1341})

  const historyTypes = [
    {
      type: "file_removed",
      label: "Удалён файл",
      svg: <svg width="9" height="11" viewBox="0 0 9 11" fill="none" xmlns="http://www.w3.org/2000/svg">
        <path
          d="M8.5 6.65385V5.30769C8.5 4.84866 8.31036 4.40844 7.97279 4.08385C7.63523 3.75927 7.17739 3.57692 6.7 3.57692H5.9C5.74087 3.57692 5.58826 3.51614 5.47574 3.40795C5.36321 3.29975 5.3 3.15301 5.3 3V2.23077C5.3 1.77174 5.11036 1.33151 4.77279 1.00693C4.43523 0.682348 3.97739 0.5 3.5 0.5H2.5M6.1 6.65385H2.9M3.7 0.5H1.1C0.7688 0.5 0.5 0.758462 0.5 1.07692V9.92308C0.5 10.2415 0.7688 10.5 1.1 10.5H7.9C8.2312 10.5 8.5 10.2415 8.5 9.92308V5.11538C8.5 3.89131 7.99429 2.71737 7.09411 1.85181C6.19394 0.986262 4.97304 0.5 3.7 0.5Z"
          stroke="#565C68" strokeLinecap="round" strokeLinejoin="round"/>
      </svg>
    },

    {
      type: "file_added",
      label: "Добавлен файл",
      svg: <svg width="9" height="11" viewBox="0 0 9 11" fill="none" xmlns="http://www.w3.org/2000/svg">
        <path
          d="M8.5 6.65385V5.30769C8.5 4.84866 8.31036 4.40844 7.97279 4.08385C7.63523 3.75927 7.17739 3.57692 6.7 3.57692H5.9C5.74087 3.57692 5.58826 3.51614 5.47574 3.40795C5.36321 3.29975 5.3 3.15301 5.3 3V2.23077C5.3 1.77174 5.11036 1.33151 4.77279 1.00693C4.43523 0.682348 3.97739 0.5 3.5 0.5H2.5M4.5 5.11538V8.19231M6.1 6.65385H2.9M3.7 0.5H1.1C0.7688 0.5 0.5 0.758462 0.5 1.07692V9.92308C0.5 10.2415 0.7688 10.5 1.1 10.5H7.9C8.2312 10.5 8.5 10.2415 8.5 9.92308V5.11538C8.5 3.89131 7.99429 2.71737 7.09411 1.85181C6.19394 0.986262 4.97304 0.5 3.7 0.5Z"
          stroke="#565C68" strokeLinecap="round" strokeLinejoin="round"/>
      </svg>

    },

    {
      type: "tags",
      label: "Изменены ключевые слова",
      svg: <svg width="9" height="9" viewBox="0 0 9 9" fill="none" xmlns="http://www.w3.org/2000/svg">
        <path
          d="M8.78907 2.22157L6.77809 0.210944C6.71124 0.144067 6.63186 0.0910172 6.5445 0.0548231C6.45714 0.018629 6.3635 0 6.26894 0C6.17438 0 6.08074 0.018629 5.99338 0.0548231C5.90602 0.0910172 5.82664 0.144067 5.75978 0.210944L0.211046 5.75996C0.143899 5.82658 0.0906632 5.90588 0.0544331 5.99325C0.0182031 6.08063 -0.000298536 6.17433 3.64259e-06 6.26892V8.27999C3.64259e-06 8.47095 0.0758576 8.65409 0.210879 8.78911C0.3459 8.92414 0.529027 9 0.719976 9H8.27969C8.37516 9 8.46672 8.96207 8.53424 8.89456C8.60175 8.82704 8.63967 8.73547 8.63967 8.64C8.63967 8.54452 8.60175 8.45295 8.53424 8.38543C8.46672 8.31792 8.37516 8.27999 8.27969 8.27999H3.74926L8.78907 3.23993C8.85594 3.17307 8.90899 3.09369 8.94518 3.00632C8.98137 2.91896 9 2.82532 9 2.73075C9 2.63618 8.98137 2.54254 8.94518 2.45518C8.90899 2.36781 8.85594 2.28843 8.78907 2.22157ZM4.67982 2.30887L5.43085 3.05993L1.61994 6.87102L0.86892 6.11997L4.67982 2.30887ZM0.719976 8.27999V6.98893L2.01098 8.27999H0.719976ZM2.87989 8.13104L2.12932 7.37998L5.93978 3.56888L6.6908 4.31994L2.87989 8.13104ZM7.19973 3.81099L5.18921 1.79991L6.26916 0.7199L8.27969 2.73097L7.19973 3.81099Z"
          fill="#565C68"/>
      </svg>

    },

    {
      type: "description",
      label: "Изменено описание",
      svg: <svg width="9" height="9" viewBox="0 0 9 9" fill="none" xmlns="http://www.w3.org/2000/svg">
        <path
          d="M8.78907 2.22157L6.77809 0.210944C6.71124 0.144067 6.63186 0.0910172 6.5445 0.0548231C6.45714 0.018629 6.3635 0 6.26894 0C6.17438 0 6.08074 0.018629 5.99338 0.0548231C5.90602 0.0910172 5.82664 0.144067 5.75978 0.210944L0.211046 5.75996C0.143899 5.82658 0.0906632 5.90588 0.0544331 5.99325C0.0182031 6.08063 -0.000298536 6.17433 3.64259e-06 6.26892V8.27999C3.64259e-06 8.47095 0.0758576 8.65409 0.210879 8.78911C0.3459 8.92414 0.529027 9 0.719976 9H8.27969C8.37516 9 8.46672 8.96207 8.53424 8.89456C8.60175 8.82704 8.63967 8.73547 8.63967 8.64C8.63967 8.54452 8.60175 8.45295 8.53424 8.38543C8.46672 8.31792 8.37516 8.27999 8.27969 8.27999H3.74926L8.78907 3.23993C8.85594 3.17307 8.90899 3.09369 8.94518 3.00632C8.98137 2.91896 9 2.82532 9 2.73075C9 2.63618 8.98137 2.54254 8.94518 2.45518C8.90899 2.36781 8.85594 2.28843 8.78907 2.22157ZM4.67982 2.30887L5.43085 3.05993L1.61994 6.87102L0.86892 6.11997L4.67982 2.30887ZM0.719976 8.27999V6.98893L2.01098 8.27999H0.719976ZM2.87989 8.13104L2.12932 7.37998L5.93978 3.56888L6.6908 4.31994L2.87989 8.13104ZM7.19973 3.81099L5.18921 1.79991L6.26916 0.7199L8.27969 2.73097L7.19973 3.81099Z"
          fill="#565C68"/>
      </svg>
    },

    {
      type: "title",
      label: "Изменено название",
      svg: <svg width="9" height="9" viewBox="0 0 9 9" fill="none" xmlns="http://www.w3.org/2000/svg">
        <path
          d="M8.78907 2.22157L6.77809 0.210944C6.71124 0.144067 6.63186 0.0910172 6.5445 0.0548231C6.45714 0.018629 6.3635 0 6.26894 0C6.17438 0 6.08074 0.018629 5.99338 0.0548231C5.90602 0.0910172 5.82664 0.144067 5.75978 0.210944L0.211046 5.75996C0.143899 5.82658 0.0906632 5.90588 0.0544331 5.99325C0.0182031 6.08063 -0.000298536 6.17433 3.64259e-06 6.26892V8.27999C3.64259e-06 8.47095 0.0758576 8.65409 0.210879 8.78911C0.3459 8.92414 0.529027 9 0.719976 9H8.27969C8.37516 9 8.46672 8.96207 8.53424 8.89456C8.60175 8.82704 8.63967 8.73547 8.63967 8.64C8.63967 8.54452 8.60175 8.45295 8.53424 8.38543C8.46672 8.31792 8.37516 8.27999 8.27969 8.27999H3.74926L8.78907 3.23993C8.85594 3.17307 8.90899 3.09369 8.94518 3.00632C8.98137 2.91896 9 2.82532 9 2.73075C9 2.63618 8.98137 2.54254 8.94518 2.45518C8.90899 2.36781 8.85594 2.28843 8.78907 2.22157ZM4.67982 2.30887L5.43085 3.05993L1.61994 6.87102L0.86892 6.11997L4.67982 2.30887ZM0.719976 8.27999V6.98893L2.01098 8.27999H0.719976ZM2.87989 8.13104L2.12932 7.37998L5.93978 3.56888L6.6908 4.31994L2.87989 8.13104ZM7.19973 3.81099L5.18921 1.79991L6.26916 0.7199L8.27969 2.73097L7.19973 3.81099Z"
          fill="#565C68"/>
      </svg>
    },
  ]

  if (event.type === "categories" || event.type === "region") return null

  const currentType = historyTypes.find(typeItem => typeItem.type === event.type)

  return (
    <div className={s.item}>
      <div className={s.leftPart}>
        <div className={s.iconWrapper}>
          {currentType.svg}
        </div>
        {
          !isLast && <div className={s.line}/>
        }
      </div>
      <div className={s.rightPart}>
        <div className={s.topPart}>
          <div className={s.name}>
            {currentType.label}
          </div>

          {
            isDesktop && <div className={s.date}>{getDateLabel(event.changedAt)}</div>
          }

        </div>

        <div className={s.info}>

          {
            currentType.type === "file_added" && <FileAddedInfo event={event}/>
          }

          {
            currentType.type === "file_removed" && <FileRemovedInfo event={event}/>
          }


          {
            currentType.type === "title" && <TitleInfo event={event}/>
          }


          {
            currentType.type === "tags" && <TagsInfo event={event}/>
          }

        </div>
      </div>
    </div>
  )
}

export default HistoryItem;