import s from './DashboardSubmenu.module.scss';
import SubmenuItem from "@/components/layout/Submenu/SubmenuItem/SubmenuItem.jsx";

const DashboardSubmenu = () => {

  const mainIcon = <svg width="16" height="15" viewBox="0 0 16 15" fill="none" xmlns="http://www.w3.org/2000/svg">
    <path
      d="M14.1538 0H1.84615C1.35652 0 0.886947 0.197544 0.540726 0.549175C0.194505 0.900806 0 1.37772 0 1.875V10.625C0 11.1223 0.194505 11.5992 0.540726 11.9508C0.886947 12.3025 1.35652 12.5 1.84615 12.5H14.1538C14.6435 12.5 15.1131 12.3025 15.4593 11.9508C15.8055 11.5992 16 11.1223 16 10.625V1.875C16 1.37772 15.8055 0.900806 15.4593 0.549175C15.1131 0.197544 14.6435 0 14.1538 0ZM14.7692 10.625C14.7692 10.7908 14.7044 10.9497 14.589 11.0669C14.4736 11.1842 14.3171 11.25 14.1538 11.25H1.84615C1.68294 11.25 1.52642 11.1842 1.41101 11.0669C1.2956 10.9497 1.23077 10.7908 1.23077 10.625V1.875C1.23077 1.70924 1.2956 1.55027 1.41101 1.43306C1.52642 1.31585 1.68294 1.25 1.84615 1.25H14.1538C14.3171 1.25 14.4736 1.31585 14.589 1.43306C14.7044 1.55027 14.7692 1.70924 14.7692 1.875V10.625ZM11.0769 14.375C11.0769 14.5408 11.0121 14.6997 10.8967 14.8169C10.7813 14.9342 10.6247 15 10.4615 15H5.53846C5.37525 15 5.21873 14.9342 5.10332 14.8169C4.98791 14.6997 4.92308 14.5408 4.92308 14.375C4.92308 14.2092 4.98791 14.0503 5.10332 13.9331C5.21873 13.8158 5.37525 13.75 5.53846 13.75H10.4615C10.6247 13.75 10.7813 13.8158 10.8967 13.9331C11.0121 14.0503 11.0769 14.2092 11.0769 14.375Z"
      fill="#131D2A"/>
  </svg>

  const organizationsIcon = <svg width="18" height="18" viewBox="0 0 18 18" fill="none"
                                 xmlns="http://www.w3.org/2000/svg">
    <path d="M13.6667 16.5V5.53846L7.83333 1.5L2 5.53846V16.5H16M6.66667 16.5V13.0385H10.1667V16.5" stroke="#3A3F49"
          strokeLinecap="round" strokeLinejoin="round"/>
  </svg>

  const profileIcon = <svg width="18" height="18" viewBox="0 0 18 18" fill="none" xmlns="http://www.w3.org/2000/svg">
    <path
      d="M12.0004 4.07692C12.0004 4.89297 11.6843 5.6756 11.1216 6.25263C10.5589 6.82967 9.79576 7.15384 9 7.15384C8.20424 7.15384 7.44108 6.82967 6.8784 6.25263C6.31571 5.6756 5.9996 4.89297 5.9996 4.07692C5.9996 3.26087 6.31571 2.47824 6.8784 1.90121C7.44108 1.32417 8.20424 1 9 1C9.79576 1 10.5589 1.32417 11.1216 1.90121C11.6843 2.47824 12.0004 3.26087 12.0004 4.07692ZM3 15.6609C3.02571 14.0464 3.66916 12.507 4.79158 11.3746C5.914 10.2422 7.42546 9.60756 9 9.60756C10.5745 9.60756 12.086 10.2422 13.2084 11.3746C14.3308 12.507 14.9743 14.0464 15 15.6609C13.1177 16.5461 11.0708 17.0029 9 17C6.85891 17 4.82664 16.5208 3 15.6609Z"
      stroke="#565C68" strokeWidth="1.2" strokeLinecap="round" strokeLinejoin="round"/>
  </svg>

  return (
    <div className={s.wrapper}>
      <div className={s.subtitle}>Личный кабинет</div>
      <ul className={s.clientItems}>
        <li>
          <SubmenuItem
            label="Обзор"
            url="/dashboard/main"
            icon={mainIcon}
          />
        </li>

        <li>
          <SubmenuItem
            label="Организации"
            url="/dashboard/organizations"
            icon={organizationsIcon}
          />
        </li>

        <li>
          <SubmenuItem
            label="Профиль пользователя"
            url="/dashboard/profile"
            icon={profileIcon}
          />
        </li>
      </ul>
    </div>
  );
};

export default DashboardSubmenu;